package com.rs.client.exceptions;

public enum ExceptionType {
    INVALID_USERNAME_OR_PASSWORD("invalid.username.or.password", 401,-100),
    NEEDSTOADDVALUE0("ზედნადების ტიპი არასწორია",400,-1001),
    NEEDSTOADDVALUE1("წაშლილ ზედნადებს, ვერ დაარედაქტირებთ და ვერ წაშლით",400,-1028),
    NEEDSTOADDVALUE2("ტრანსპორტირების ტიპი არასწორია",400,-1002),
    NEEDSTOADDVALUE3("მძღოლის პირადი ნომერი არასწორია",400,-1014),
    NEEDSTOADDVALUE4("reception_info დიდია",400,-1015),
    NEEDSTOADDVALUE5("receiver_info დიდია",400,-1016),
    NEEDSTOADDVALUE6("მიწოდების თარიღი მეტია მიმდინარე თარიღზე",400,-1017),
    NEEDSTOADDVALUE7("მყიდველის სახელი აუცილებელია, როცა მყიდველი უცხო ქვეყნის მოქალაქეა",400,-1003),
    NEEDSTOADDVALUE8("მიწოდების თარიღი ნაკლებია ტრანსპორტირების დაწყების თარიღზე",400,-1018),
    NEEDSTOADDVALUE9("მყიდველი აუცილებელია ყოველთვის გარდა შიდა გადაზიდვისა",400,-1004),
    NEEDSTOADDVALUE10("სტატუსი არასწორია",400,-1019),
    NEEDSTOADDVALUE11("შეუნახავს ვერ წაშლით",400,-1020),
    NEEDSTOADDVALUE12("შეუნახავს ვერ გააუქმებთ",400,-1021),
    NEEDSTOADDVALUE13("გამყიდველი ლიკვიდირებულია",400,-1022),
    NEEDSTOADDVALUE14("მყიდვევლი არ მოიძებნა (საქართველო)",400,-1005),
    NEEDSTOADDVALUE15("მყიდველი ლიკვიდირებულია ან კოდი გაუქმებულია",400,-1006),
    NEEDSTOADDVALUE16("ტრანსპორტირების დაწყების ადგილი (მისამართი) დიდია",400,-1007),
    NEEDSTOADDVALUE17("ქვე-ზედნადებისთვის მშობელი აუცილებელია",400,-1023),
    NEEDSTOADDVALUE18("მძღოლის პირადი ნომერი დიდია",400,-1008),
    NEEDSTOADDVALUE19("დასრულებულის რედაქტირებას ვერ შეძლებთ",400,-1027),
    NEEDSTOADDVALUE20("ტრანსპორტირების დაწყების ადგილი (მისამართი) აუცილებელია",400,-1009),
    NEEDSTOADDVALUE21("ტრანსპორტირების დასრულების ადგილი (მისამართი) დიდია",400,-1010),
    NEEDSTOADDVALUE22("გაუქმებულ ზედნადებს, ვერ დაარედაქტირებთ და ვერ წაშლით",400,-1029),
    NEEDSTOADDVALUE23("მშობელ ზედნადებს ვერ გააუქმებთ თუ ქვე-ზედნადები აქვს",400,-1030),
    NEEDSTOADDVALUE24("ტრანსპორტირების დასრულების ადგილი (მისამართი) აუცილებელია",400,-1011),
    NEEDSTOADDVALUE25("მშობელი არ მოიძებნა ან მშობელი გააქტიურებული არ არის",400,-1024),
    NEEDSTOADDVALUE26("ქვე-ზედნადები მხოლოდ დისტრიბუციაზე იწერება",400,-1025),
    NEEDSTOADDVALUE27("მანქანის ნომერი არასწორია",400,-1026),
    NEEDSTOADDVALUE28("მძღოლის მითითება აუცილებელია, ტრანსპორტირების ტიპის ყველა ზედნადებზე",400,-1012),
    NEEDSTOADDVALUE29("მძღოლის სახელი აუცილებელია, როდესაც მძღოლი უცხო ქვეყნის მოქალაქეა",400,-1013),
    NEEDSTOADDVALUE44("აქტივაციის თარიღი  ნაკლებია შექმნის თარიღზე",400,-1034),
    NEEDSTOADDVALUE46("\"ტრანსპორტირების გარეშე\" შემთხვევაში,  დაწყების და დასრულების ადგილი უნდა ემთხვეოდეს",400,-1036),
    NEEDSTOADDVALUE47("გადავადების (აქტივაციის) თარიღი არ უნდა აღემატებოდეს 3 დღეს",400,-1038),
    NEEDSTOADDVALUE49("მყიდველის სერვისის მომხმარებლის ID არასწორია",400,-1041),
    NEEDSTOADDVALUE51("ფაქტურაზე მიბმულ ზედნადებს ვერ დაარედაქტირებთ",400,-1042),
    NEEDSTOADDVALUE54("გადამზიდავის ს/ნ არასწორია",400,-1048),
    NEEDSTOADDVALUE55("გადამზიდავის ს/ნ მნიშვნელობის მინიჭება, შეცვლა ან წაშლა შეგიძლიათ მხოლოდ \"გადამზიდავთან გადაგზავნილი\" სტატუსის ზედნადებზე",400,-1049),
    NEEDSTOADDVALUE56("გადამზიდავის ს/ნ აუცილებელია",400,-1050),
    NEEDSTOADDVALUE57("მძღოლის მონაცემებს და ტრანსპორტირების ტიპს ავსებს გადამზიდავი",400,-1053),
    NEEDSTOADDVALUE58("თქვენ გაქვთ წაუკითხავი, აუცილებელი შეტყობინება (გაეცანით შეტყობინებას და შემდეგ შეგეძლებათ ზედნადების გამოწერა)",400,-1061),
    NEEDSTOADDVALUE59("გადამზიდი შეგიძლიათ გამოიყენოთ, მხოლოდ ტრანსპორტირებით ან შიდა გადაზიდვის ტიპის ზედნადებებზე",400,-1062),
    NEEDSTOADDVALUE61("ხე-ტყის ზედნადების დისტრიბუციას ვერ გამოწერთ",400,-1067),
    NEEDSTOADDVALUE62("აღნიშნულ პირზე ქვე-ზედნადების შექმნა შეუძლებელია! დაუკავშირდით ქოლცენტრს!",400,-1068),
    NEEDSTOADDVALUE63("ხე-ტყის ფაქტურების პროტოკოლი შეიცვალა 2016 წლის 1 აგვისტოდან",400,-1069),
    NEEDSTOADDVALUE67("გადაგზავნილს ვერ წაშლით",400,-1031),
    NEEDSTOADDVALUE68("ქვე-ზედნადებს ძირითად ზედნადებად ვერ გადააკეთებთ",400,-1032),
    NEEDSTOADDVALUE69("გამოწერილ ზედნადებს, ქვე-ზედნადებად ვერ გადააკეთებთ",400,-1033),
    NEEDSTOADDVALUE70("შიდა გადაზიდვის დროს, მყიდველის საიდენტიფიკაციო კოდი უნდა იყოს ცარიელი ან გამყიდველის კოდი უნდა იყოს მითითებული",400,-1035),
    NEEDSTOADDVALUE71("მყიდველი უნდა განსხვავდებოდეს გამყიდველისგან, თუ შიდა გადაზიდვა არ არის",400,-1039),
    NEEDSTOADDVALUE72("ფაქტურაში, საქონლის ჩამონათვალში მოხდა შეცდომა",400,-3007),
    NEEDSTOADDVALUE73("ფაქტურის შენახვისას მოხდა შედომა",400,-3008),
    NEEDSTOADDVALUE74("გაურკვეველი შეცდომა",400,-1),
    NEEDSTOADDVALUE75("სერვისის მომხმარებელი ან პაროლი არასწორია",400,-100),
    NEEDSTOADDVALUE76("გამომწერის un_id განსხვავდება XML-ში მითითებული seler_un_id -ის გან ",400,-101),
    NEEDSTOADDVALUE77("ფაქტურაში, ზედნადებების ჩამონათვალში მოხდა შეცდომა",400,-3009),
    NEEDSTOADDVALUE78("მანქანის ნომერი აუცილებელია",400,-1040),
    NEEDSTOADDVALUE81("\"გადამზიდავთან გადაგზავნილი\" სტატუსის ზედნადებზე, მძღოლის მონაცემებს და ტრანსპორტირების ტიპს ვერ შეცვლით",400,-1051),
    NEEDSTOADDVALUE82("\"გადამზიდავთან გადაგზავნილი\" სტატუსის ზედნადებს, თქვენ ვერ დაასრულებთ (ასრულებს გადამზიდავი კომპანია)",400,-1052),
    NEEDSTOADDVALUE83("დასრულებულ ზედნადებზე ქვე-ზედნადებს ვერ გამოწერთ",400,-1059),
    NEEDSTOADDVALUE84("უცხო ქვეყნის მოქალაქის პირადი ნომერი არასწორია (მძღოლის)",400,-1065),
    NEEDSTOADDVALUE85("უცხო ქვეყნის მოქალაქის პირადი ნომერი არასწორია (მყიდველის)",400,-1066),
    NEEDSTOADDVALUE87("თუ ტრანსპორტირების ტიპი არის სხვა, მიუთითეთ TRANS_TXT",400,-1037),
    NEEDSTOADDVALUE88("შეცდომა მოხდა სასაქონლო მატერიალური ფასეულობების სიაში",400,-4001),
    NEEDSTOADDVALUE94("ზედნადების კატეგორია არასწორია",400,-1060),
    NEEDSTOADDVALUE95("ხე-ტყის დოკუმენტი აუცილებელია",400,-1055),
    NEEDSTOADDVALUE96("ხე-ტყის დოკუმენტის ნომერი აუცილებელია",400,-1056),
    NEEDSTOADDVALUE97("ხე-ტყის დოკუმენტის თარიღი აუცილებელია",400,-1057),
    NEEDSTOADDVALUE98("ზედნადების კატეგორიის შეცვლა შეიძლება მხოლოდ შენახულ ზედნადებზე",400,-1058),
    NEEDSTOADDVALUE100("შეცდომა მოხდა ხე-ტყის ფირნიშის ნომრებში",400,-4003),
    NEEDSTOADDVALUE103("შეცდომა მოხდა XML-ის პარსირებისას ან SELER_UN_ID ტეგი არ გაქვთ",400,-102),
    NEEDSTOADDVALUE109("სატესტო კოდებიდან მხოლოდ სატესტოზე გამოწერეთ.  სატესტო კოდებია : 206322102 ; 12345678910 ; ",400,-4002),
    NEEDSTOADDVALUE114("ცარიელ ზედნადებს ვერ გააქტიურებთ",400,-1045),
    NEEDSTOADDVALUE115("აქტიურ ზედნადებზე, ზედნადების ტიპს ვერ შეცვლით",400,-1046),
    NEEDSTOADDVALUE116("გამყიდველი და მყიდველი მხოლოდ შიდა გადაზიდვის დროს შეიძლება იყოს ერთი და იგივე",400,-1047),
    NEEDSTOADDVALUE123("ზედნადების id არასწორია",400,-103),
    NEEDSTOADDVALUE124("თქვენ არ ხართ ამ ზედნადების გადამზიდავი",400,-1054),
    NEEDSTOADDVALUE125("კორექტირება შეუძლებელია, ვინაიდან დადასტურებულია საბაჟოს მიერ",400,-1063),
    NEEDSTOADDVALUE126("შექმნის თარიღის დიაპაზონის მითითება აუცილებელია და არ უნდა აღემატებოდეს 72 საათს",400,-1064),
    NEEDSTOADDVALUE128("ბოლოს განხორციელებული ცვლილების თარიღი, უნდა იყოს ზედნადების შექმნის თარიღების შუალედში",400,-1073),
    NEEDSTOADDVALUE133("ზედნადების გამოწერა შეზღუდულია აღნიშნულ სატრანსპორტო საშუალებაზე",400,-1071),
    NEEDSTOADDVALUE136("გაცნობებთ, რომ თქვენ შეზღუდული გაქვთ ავანსის ანგარიშ-ფაქტურის/ზედნადების/საგადასახადო დოკუმენტის გამოწერის უფლება",400,-1100),
    NEEDSTOADDVALUE138("ბოლოს განხორციელებული ცვლილების თარიღის დიაპაზონის მითითება აუცილებელია და არ უნდა აღემატებოდეს 3 დღეს",400,-1072),
    NEEDSTOADDVALUE139("დიაპაზონის საწყისი თარიღი ნაკლებია დასრულების თარიღზე",400,-1074);

    private final String keyWord;
    private final int errorCode;
    private final int rsStatus;

    ExceptionType(String keyWord, int errorCode, int rsStatus) {
        this.keyWord = keyWord;
        this.errorCode = errorCode;
        this.rsStatus = rsStatus;
    }

    public String getKeyWord() {
        return keyWord;
    }

    public int getErrorCode() {
        return errorCode;
    }

    public int getRsStatus() {
        return rsStatus;
    }
    public static ExceptionType findByStatusCode(Integer status){
        for(ExceptionType v : values()){
            if( v.getRsStatus()==(status)){
                return v;
            }
        }
        return null;
    }
}